PBL5/4_Facebook_Newsfeed/loadtest/dataInsert/userCreate.yml
config:
  name: "User Creation Test - All 700 Users in 2 Minutes"
  target: "http://localhost:3000"
  phases:
    - duration: 120
      arrivalCount: 700 
      name: "Create all 700 users in 2 minutes"
  payload:
    path: "./dummyData/user.csv"
    fields:
      - "username"
    order: "sequence"  # Process CSV in order
  processor: "./user.js"

scenarios:
  - name: "Create User"
    flow:
      - post:
          url: "/api/users"
          headers:
            Content-Type: "application/json"
          json:
            username: "{{ username }}"
          capture:
            - json: "$.user.id"
              as: "userId"
            - json: "$.message"
              as: "message"
      - log: "Created user: {{ username }} with ID: {{ userId }}"